case/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

codedSource
{
    type            coded;
    name            USrc;
    active          true;

    selectionMode   all;
    fields          (U);
    field             U;

    xmax           0.06;
    ymax           0.06;
    xmin           0.02;
    ymin           0.02;
    box ($xmin $ymin -1) ($xmax $ymax 1);
    Sv  1e-3;

    codeInclude
    #{
        #include "cellSet.H"
        #include "boxToCell.H"
    #};

    codeCorrect
    #{
    #};

    codeConstrain
    #{
    #};

    codeAddSup
    #{
        Info<< "Executing codeAddSup" << endl;

        // Coefficients field
        autoPtr<volScalarField> kPtr;
        if (!Pstream::parRun()) {
            kPtr.reset
            (
                new volScalarField
                (
                    IOobject
                    (
                        "k",
                        Foam::name(mesh().time().startTime().value()),
                        mesh(),
                        IOobject::NO_READ,
                        IOobject::NO_WRITE,
                        false
                    ),
                    mesh(),
                    dimensionedScalar("z", dimless, 0)
                )
            );
        } else {
            kPtr.reset
            (
                new volScalarField
                (
                    IOobject
                    (
                        "k",
                        Foam::name(mesh().time().startTime().value()),
                        mesh(),
                        IOobject::MUST_READ,
                        IOobject::NO_WRITE,
                        false
                    ),
                    mesh()
                )
            );
        }
        volScalarField&  k = kPtr();

        // Total source value
        scalar Sv = readScalar(coeffs().lookup("Sv"));

        // Setup the box and select cells
        //const word boxString = "(0.02 0.025 -1) (0.04 0.035 1)";
        boxToCell box(mesh(), coeffs());
        cellSet boxCells(mesh(), "boxCells", IOobject::NO_READ);
        box.applyToSet(topoSetSource::setAction::NEW, boxCells);

        // Randomize k if running in serial
        if (!Pstream::parRun()) {
            Random rd(1234);
            for(auto& c: boxCells.toc()) {
                k[c] = rd.sample01<scalar>();
            }
        }
        Info<<"Fixed" << endl;
        // Apply source to the selected cells
        vectorField& USource = eqn.source();
        for(auto& c: boxCells.toc()) {
            scalar kAvg = k[c];
            // Loop through neighbours of cell c, to get an average value for k
            for(auto& e : mesh().cellCells()[c]){
                kAvg += k[e];
            }
            kAvg = kAvg / (mesh().cellCells()[c].size()+1);
            USource[c] = vector(Sv*kAvg, 0, 0);
        }
        Info<<"Fixed" << endl;
        if (mesh().time().writeTime()) k.write();
        Info<<"Fixed" << endl;
    #};
}

// ************************************************************************* //
